#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_elastic_beanstalk_application.example will be created
  + resource "aws_elastic_beanstalk_application" "example" {
      + arn         = (known after apply)
      + description = "Example Elastic Beanstalk Application"
      + id          = (known after apply)
      + name        = "cq-elastic-beanstalk-app"
      + tags_all    = (known after apply)
    }

  # module.demo.aws_elastic_beanstalk_application_version.elastic-beanstalk-version will be created
  + resource "aws_elastic_beanstalk_application_version" "elastic-beanstalk-version" {
      + application  = "cq-elastic-beanstalk-app"
      + arn          = (known after apply)
      + bucket       = (known after apply)
      + description  = "application version created by terraform"
      + force_delete = false
      + id           = (known after apply)
      + key          = (known after apply)
      + name         = "cq-elastic-beanstalk-app-version"
      + tags_all     = (known after apply)
    }

  # module.demo.aws_elastic_beanstalk_environment.env will be created
  + resource "aws_elastic_beanstalk_environment" "env" {
      + all_settings           = (known after apply)
      + application            = "cq-elastic-beanstalk-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + description            = "Example Elastic Beanstalk Environment"
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "cq-elastic-beanstalk-env"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.5.0 running Go 1"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "cq-elasticbeanstalk-ec2-role"
        }
    }

  # module.demo.aws_iam_instance_profile.elastic-beanstalk-profile will be created
  + resource "aws_iam_instance_profile" "elastic-beanstalk-profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "cq-elasticbeanstalk-ec2-role"
      + path        = "/"
      + role        = "cq-elastic-beanstalk-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.demo.aws_iam_role.elastic-beanstalk-role will be created
  + resource "aws_iam_role" "elastic-beanstalk-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cq-elastic-beanstalk-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.demo.aws_iam_role_policy_attachment.elastic-beanstalk-role-policy-attachment["arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"] will be created
  + resource "aws_iam_role_policy_attachment" "elastic-beanstalk-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"
      + role       = "cq-elastic-beanstalk-role"
    }

  # module.demo.aws_iam_role_policy_attachment.elastic-beanstalk-role-policy-attachment["arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"] will be created
  + resource "aws_iam_role_policy_attachment" "elastic-beanstalk-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"
      + role       = "cq-elastic-beanstalk-role"
    }

  # module.demo.aws_iam_role_policy_attachment.elastic-beanstalk-role-policy-attachment["arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"] will be created
  + resource "aws_iam_role_policy_attachment" "elastic-beanstalk-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"
      + role       = "cq-elastic-beanstalk-role"
    }

  # module.demo.aws_s3_bucket.elastic-beanstalk-bucket will be created
  + resource "aws_s3_bucket" "elastic-beanstalk-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cq-elastic-beanstalk-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.demo.aws_s3_bucket_acl.elastic-beanstalk-bucket-acl will be created
  + resource "aws_s3_bucket_acl" "elastic-beanstalk-bucket-acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.demo.aws_s3_bucket_public_access_block.elastic-beanstalk-bucket-public-access-block will be created
  + resource "aws_s3_bucket_public_access_block" "elastic-beanstalk-bucket-public-access-block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.demo.aws_s3_object.elastic-beanstalk-object will be created
  + resource "aws_s3_object" "elastic-beanstalk-object" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content                = "go-v1.zip"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "beanstalk/go-v1.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*